fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОшибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
        // Получаем текущий год
        ТекущийГод = Число(Строка(Год(ТекущаяДатаСеанса())));
        
       // Создаём массив значений (только числа — так безопаснее для передачи на клиент)
        МассивГодов = Новый Массив;
//        МассивГодов.Добавить(Формат(ТекущийГод - 1, "ЧГ=0;"));
//        МассивГодов.Добавить(Формат(ТекущийГод, "ЧГ=0"));
//        МассивГодов.Добавить(Формат(ТекущийГод + 1, "ЧГ=0"));
		МассивГодов.Добавить(ТекущийГод - 1);
        МассивГодов.Добавить(ТекущийГод);
        МассивГодов.Добавить(ТекущийГод + 1);
        
        // Заполняем существующую коллекцию СписокВыбора через ЗагрузитьЗначения()
        Элементы.Год.СписокВыбора.ЗагрузитьЗначения(МассивГодов);
        
    Исключение
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не удалось сформировать список годов: " + ОписаниеОшибки();
        Сообщение.Поле = "ГодДляВыбора";
        Сообщение.Сообщить();
        
        ЗаписьЖурналаРегистрации(
            "Ошибка формирования списка годов",
            УровеньЖурналаРегистрации.Ошибка,
            Метаданные.Документы.ВКМ_ГрафикОтпусков, // Укажи свой объект
            Неопределено,
            ОписаниеОшибки()
        );
        
        Отказ = Истина;
	КонецПопытки;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
    ПересчитатьФлагиОшибок();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
    ПересчитатьФлагиОшибок();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПослеУдаления(Элемент)
	ПересчитатьФлагиОшибок();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	ПараметрыОткрытия = СохратитьОтпускаВоВременноеХранилище();
	Если ПараметрыОткрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыОткрытия, ЭтотОбъект, , , , , );
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохратитьОтпускаВоВременноеХранилище()
	Результат = Неопределено;
	ЕстьОшибка = Ложь;
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.ЕстьОшибка Тогда
			ТекстСообщения = СтрШаблон("Для сотрудника %1 установлены некорректные периоды отпуска",Строка.Сотрудник);
        	Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			ЕстьОшибка = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если ЕстьОшибка Тогда
		Возврат Результат;
	КонецЕсли;
			
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();	
	Результат = Новый Структура("АдресВХранилище");
	Результат.АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаОтпусков,УникальныйИдентификатор);
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ПересчитатьФлагиОшибок()
    
    СуммыПоСотрудникам = Новый Соответствие;
    ГодДокумента = Год(Дата(Объект.Год, 01, 01));
    
    // 1. Сначала считаем суммы дней по сотрудникам
    Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
        Если СтрокаТЧ.Сотрудник = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        
        Дней = РассчитатьКоличествоДней(СтрокаТЧ.ДатаНачала, СтрокаТЧ.ДатаОкончания);
        
        Если СуммыПоСотрудникам.Получить(СтрокаТЧ.Сотрудник) = Неопределено Тогда
            СуммыПоСотрудникам.Вставить(СтрокаТЧ.Сотрудник, Дней);
        Иначе
            СуммыПоСотрудникам[СтрокаТЧ.Сотрудник] = СуммыПоСотрудникам[СтрокаТЧ.Сотрудник] + Дней;
        КонецЕсли;
    КонецЦикла;
    
    // 2. Теперь ставим флаг ошибки для каждой строки
    Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
        ЕстьОшибкаГода = Ложь;
        ПревышениеДней = Ложь;
        
        // Проверка года
        Если СтрокаТЧ.ДатаНачала <> Неопределено И СтрокаТЧ.ДатаОкончания <> Неопределено Тогда
            Если Год(СтрокаТЧ.ДатаНачала) <> ГодДокумента Тогда
                ЕстьОшибкаГода = Истина;
            КонецЕсли;
            Если Год(СтрокаТЧ.ДатаОкончания) <> ГодДокумента Тогда
                ЕстьОшибкаГода = Истина;
            КонецЕсли;
        Иначе
            ЕстьОшибкаГода = Истина; // даты не заполнены
        КонецЕсли;
        
        // Лимит 28 дней
        СуммаДней = СуммыПоСотрудникам.Получить(СтрокаТЧ.Сотрудник);
        Если СуммаДней > 28 Тогда
            ПревышениеДней = Истина;
        КонецЕсли;
        
        СтрокаТЧ.ЕстьОшибка = ЕстьОшибкаГода ИЛИ ПревышениеДней;
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция РассчитатьКоличествоДней(ДатаНачала, ДатаОкончания)
    Если ДатаНачала = Неопределено Или ДатаОкончания = Неопределено Тогда
        Возврат 0;
    КонецЕсли;
    
    Если ДатаОкончания < ДатаНачала Тогда
        Возврат 0;
    КонецЕсли;
    
    Возврат Цел((ДатаОкончания - ДатаНачала) / 86400) + 1; // включительно
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
 
 УсловноеОформление.Элементы.Очистить();
 
 ЭлементОформления = УсловноеОформление.Элементы.Добавить();

 ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
 ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");

 ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
 ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ЕстьОшибка");
 ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
 ОтборЭлемента.ПравоеЗначение = Истина;
 ОтборЭлемента.Использование = Истина;

 ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);

КонецПроцедуры

#КонецОбласти
